#### Terraform Format and Style 🖌`success`
### Workspace

`undefined`

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```hcl
terraform
github_membership.user_membership["TranNgocNam2"]: Refreshing state... [id=fptudsc:TranNgocNam2]
github_team.teams["frontend"]: Refreshing state... [id=7937043]
github_membership.user_membership["dangtrannam"]: Refreshing state... [id=fptudsc:dangtrannam]
github_membership.admin_membership["quangdatpham"]: Refreshing state... [id=fptudsc:quangdatpham]
github_membership.user_membership["kaitoz11"]: Refreshing state... [id=fptudsc:kaitoz11]
github_membership.admin_membership["baolongv3"]: Refreshing state... [id=fptudsc:baolongv3]
github_membership.user_membership["YP2743"]: Refreshing state... [id=fptudsc:YP2743]
github_membership.admin_membership["pphuc25"]: Refreshing state... [id=fptudsc:pphuc25]
github_team.teams["backend"]: Refreshing state... [id=7937041]
github_team.teams["branch_leader"]: Refreshing state... [id=7937094]
github_team.teams["devops"]: Refreshing state... [id=7937042]
github_team_members.some_team_members["branch_leader"]: Refreshing state... [id=7937094]
github_team_members.some_team_members["devops"]: Refreshing state... [id=7937042]
github_team_members.some_team_members["frontend"]: Refreshing state... [id=7937043]
github_team_members.some_team_members["backend"]: Refreshing state... [id=7937041]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_membership.admin_membership["pphuc25"] will be destroyed
  # (because key ["pphuc25"] is not in for_each map)
  - resource "github_membership" "admin_membership" {
      - etag     = "W/\"67eb3e16f5b6da40a994135a52dde8bb742f420644b46a02fd6584b806b60c8b\"" -> null
      - id       = "fptudsc:pphuc25" -> null
      - role     = "admin" -> null
      - username = "pphuc25" -> null
    }

  # github_membership.user_membership["pphuc25"] will be created
  + resource "github_membership" "user_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "pphuc25"
    }

  # github_membership.user_membership["quangdatpham"] will be created
  + resource "github_membership" "user_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "quangdatpham"
    }

  # github_membership.user_membership["trungkien100823"] will be created
  + resource "github_membership" "user_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "trungkien100823"
    }

  # github_team.teams["operator"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Group consist of github organization owner"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "operator"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.some_team_members["backend"] will be updated in-place
  ~ resource "github_team_members" "some_team_members" {
        id      = "7937041"
        # (2 unchanged attributes hidden)

      - members {
          - role     = "maintainer" -> null
          - username = "baolongv3" -> null
        }
      + members {
          + role     = "member"
          + username = "dangtrannam"
        }
    }

  # github_team_members.some_team_members["branch_leader"] will be updated in-place
  ~ resource "github_team_members" "some_team_members" {
        id      = "7937094"
        # (2 unchanged attributes hidden)

      - members {
          - role     = "maintainer" -> null
          - username = "baolongv3" -> null
        }
      + members {
          + role     = "member"
          + username = "pphuc25"
        }
      + members {
          + role     = "member"
          + username = "quangdatpham"
        }
      + members {
          + role     = "member"
          + username = "trungkien100823"
        }
    }

  # github_team_members.some_team_members["frontend"] will be updated in-place
  ~ resource "github_team_members" "some_team_members" {
        id      = "7937043"
        # (2 unchanged attributes hidden)

      - members {
          - role     = "maintainer" -> null
          - username = "baolongv3" -> null
        }
      + members {
          + role     = "member"
          + username = "dangtrannam"
        }
    }

  # github_team_members.some_team_members["operator"] will be created
  + resource "github_team_members" "some_team_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "baolongv3"
        }
      + members {
          + role     = "member"
          + username = "quangdatpham"
        }
    }

Plan: 5 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Pusher**: @baolongv3
**Action**: pull_request
